AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_ctimer.h
//*****************************************************************************
//
//  am_reg_ctimer.h
//! @file
//!
//! @brief Register macros for the CTIMER module
//
//*****************************************************************************

//*****************************************************************************
//
// ${copyright}
//
// This is part of revision ${version} of the AmbiqSuite Development Package.
//
//*****************************************************************************
#ifndef AM_REG_CTIMER_H
#define AM_REG_CTIMER_H

//*****************************************************************************
//
//! @brief CTIMER
//! Instance finder. (1 instance(s) available)
//
//*****************************************************************************
#define AM_REG_CTIMER_NUM_MODULES                    1
#define AM_REG_CTIMERn(n) \
    (REG_CTIMER_BASEADDR + 0x00000010 * n)
//*****************************************************************************
//
// Register offsets.
//
//*****************************************************************************
#define AM_REG_CTIMER_TMR0_O                         0x00000000
#define AM_REG_CTIMER_CMPRA0_O                       0x00000004
#define AM_REG_CTIMER_CMPRB0_O                       0x00000008
#define AM_REG_CTIMER_CTRL0_O                        0x0000000C
#define AM_REG_CTIMER_TMR1_O                         0x00000010
#define AM_REG_CTIMER_CMPRA1_O                       0x00000014
#define AM_REG_CTIMER_CMPRB1_O                       0x00000018
#define AM_REG_CTIMER_CTRL1_O                        0x0000001C
#define AM_REG_CTIMER_TMR2_O                         0x00000020
#define AM_REG_CTIMER_CMPRA2_O                       0x00000024
#define AM_REG_CTIMER_CMPRB2_O                       0x00000028
#define AM_REG_CTIMER_CTRL2_O                        0x0000002C
#define AM_REG_CTIMER_TMR3_O                         0x00000030
#define AM_REG_CTIMER_CMPRA3_O                       0x00000034
#define AM_REG_CTIMER_CMPRB3_O                       0x00000038
#define AM_REG_CTIMER_CTRL3_O                        0x0000003C
#define AM_REG_CTIMER_INTEN_O                        0x00000200
#define AM_REG_CTIMER_INTSTAT_O                      0x00000204
#define AM_REG_CTIMER_INTCLR_O                       0x00000208
#define AM_REG_CTIMER_INTSET_O                       0x0000020C

//*****************************************************************************
//
// CTIMER_INTEN - Counter/Timer Interrupts: Enable
//
//*****************************************************************************
// Counter/Timer B3 interrupt.
#define AM_REG_CTIMER_INTEN_CTMRB3INT_S              7
#define AM_REG_CTIMER_INTEN_CTMRB3INT_M              0x00000080
#define AM_REG_CTIMER_INTEN_CTMRB3INT(n)             (((uint32_t)(n) << 7) & 0x00000080)

// Counter/Timer A3 interrupt.
#define AM_REG_CTIMER_INTEN_CTMRA3INT_S              6
#define AM_REG_CTIMER_INTEN_CTMRA3INT_M              0x00000040
#define AM_REG_CTIMER_INTEN_CTMRA3INT(n)             (((uint32_t)(n) << 6) & 0x00000040)

// Counter/Timer B2 interrupt.
#define AM_REG_CTIMER_INTEN_CTMRB2INT_S              5
#define AM_REG_CTIMER_INTEN_CTMRB2INT_M              0x00000020
#define AM_REG_CTIMER_INTEN_CTMRB2INT(n)             (((uint32_t)(n) << 5) & 0x00000020)

// Counter/Timer A2 interrupt.
#define AM_REG_CTIMER_INTEN_CTMRA2INT_S              4
#define AM_REG_CTIMER_INTEN_CTMRA2INT_M              0x00000010
#define AM_REG_CTIMER_INTEN_CTMRA2INT(n)             (((uint32_t)(n) << 4) & 0x00000010)

// Counter/Timer B1 interrupt.
#define AM_REG_CTIMER_INTEN_CTMRB1INT_S              3
#define AM_REG_CTIMER_INTEN_CTMRB1INT_M              0x00000008
#define AM_REG_CTIMER_INTEN_CTMRB1INT(n)             (((uint32_t)(n) << 3) & 0x00000008)

// Counter/Timer A1 interrupt.
#define AM_REG_CTIMER_INTEN_CTMRA1INT_S              2
#define AM_REG_CTIMER_INTEN_CTMRA1INT_M              0x00000004
#define AM_REG_CTIMER_INTEN_CTMRA1INT(n)             (((uint32_t)(n) << 2) & 0x00000004)

// Counter/Timer B0 interrupt.
#define AM_REG_CTIMER_INTEN_CTMRB0INT_S              1
#define AM_REG_CTIMER_INTEN_CTMRB0INT_M              0x00000002
#define AM_REG_CTIMER_INTEN_CTMRB0INT(n)             (((uint32_t)(n) << 1) & 0x00000002)

// Counter/Timer A0 interrupt.
#define AM_REG_CTIMER_INTEN_CTMRA0INT_S              0
#define AM_REG_CTIMER_INTEN_CTMRA0INT_M              0x00000001
#define AM_REG_CTIMER_INTEN_CTMRA0INT(n)             (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// CTIMER_INTSTAT - Counter/Timer Interrupts: Status
//
//*****************************************************************************
// Counter/Timer B3 interrupt.
#define AM_REG_CTIMER_INTSTAT_CTMRB3INT_S            7
#define AM_REG_CTIMER_INTSTAT_CTMRB3INT_M            0x00000080
#define AM_REG_CTIMER_INTSTAT_CTMRB3INT(n)           (((uint32_t)(n) << 7) & 0x00000080)

// Counter/Timer A3 interrupt.
#define AM_REG_CTIMER_INTSTAT_CTMRA3INT_S            6
#define AM_REG_CTIMER_INTSTAT_CTMRA3INT_M            0x00000040
#define AM_REG_CTIMER_INTSTAT_CTMRA3INT(n)           (((uint32_t)(n) << 6) & 0x00000040)

// Counter/Timer B2 interrupt.
#define AM_REG_CTIMER_INTSTAT_CTMRB2INT_S            5
#define AM_REG_CTIMER_INTSTAT_CTMRB2INT_M            0x00000020
#define AM_REG_CTIMER_INTSTAT_CTMRB2INT(n)           (((uint32_t)(n) << 5) & 0x00000020)

// Counter/Timer A2 interrupt.
#define AM_REG_CTIMER_INTSTAT_CTMRA2INT_S            4
#define AM_REG_CTIMER_INTSTAT_CTMRA2INT_M            0x00000010
#define AM_REG_CTIMER_INTSTAT_CTMRA2INT(n)           (((uint32_t)(n) << 4) & 0x00000010)

// Counter/Timer B1 interrupt.
#define AM_REG_CTIMER_INTSTAT_CTMRB1INT_S            3
#define AM_REG_CTIMER_INTSTAT_CTMRB1INT_M            0x00000008
#define AM_REG_CTIMER_INTSTAT_CTMRB1INT(n)           (((uint32_t)(n) << 3) & 0x00000008)

// Counter/Timer A1 interrupt.
#define AM_REG_CTIMER_INTSTAT_CTMRA1INT_S            2
#define AM_REG_CTIMER_INTSTAT_CTMRA1INT_M            0x00000004
#define AM_REG_CTIMER_INTSTAT_CTMRA1INT(n)           (((uint32_t)(n) << 2) & 0x00000004)

