AmbiqAI/edgeimpulse-examples/fomo/apollo5/includes/extern/AmbiqSuite/ambiqsuite_b36aab438d0f/mcu/apollo/regs/am_reg_ctimer.h
// Counter/Timer B0 interrupt.
#define AM_REG_CTIMER_INTSTAT_CTMRB0INT_S            1
#define AM_REG_CTIMER_INTSTAT_CTMRB0INT_M            0x00000002
#define AM_REG_CTIMER_INTSTAT_CTMRB0INT(n)           (((uint32_t)(n) << 1) & 0x00000002)

// Counter/Timer A0 interrupt.
#define AM_REG_CTIMER_INTSTAT_CTMRA0INT_S            0
#define AM_REG_CTIMER_INTSTAT_CTMRA0INT_M            0x00000001
#define AM_REG_CTIMER_INTSTAT_CTMRA0INT(n)           (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// CTIMER_INTCLR - Counter/Timer Interrupts: Clear
//
//*****************************************************************************
// Counter/Timer B3 interrupt.
#define AM_REG_CTIMER_INTCLR_CTMRB3INT_S             7
#define AM_REG_CTIMER_INTCLR_CTMRB3INT_M             0x00000080
#define AM_REG_CTIMER_INTCLR_CTMRB3INT(n)            (((uint32_t)(n) << 7) & 0x00000080)

// Counter/Timer A3 interrupt.
#define AM_REG_CTIMER_INTCLR_CTMRA3INT_S             6
#define AM_REG_CTIMER_INTCLR_CTMRA3INT_M             0x00000040
#define AM_REG_CTIMER_INTCLR_CTMRA3INT(n)            (((uint32_t)(n) << 6) & 0x00000040)

// Counter/Timer B2 interrupt.
#define AM_REG_CTIMER_INTCLR_CTMRB2INT_S             5
#define AM_REG_CTIMER_INTCLR_CTMRB2INT_M             0x00000020
#define AM_REG_CTIMER_INTCLR_CTMRB2INT(n)            (((uint32_t)(n) << 5) & 0x00000020)

// Counter/Timer A2 interrupt.
#define AM_REG_CTIMER_INTCLR_CTMRA2INT_S             4
#define AM_REG_CTIMER_INTCLR_CTMRA2INT_M             0x00000010
#define AM_REG_CTIMER_INTCLR_CTMRA2INT(n)            (((uint32_t)(n) << 4) & 0x00000010)

// Counter/Timer B1 interrupt.
#define AM_REG_CTIMER_INTCLR_CTMRB1INT_S             3
#define AM_REG_CTIMER_INTCLR_CTMRB1INT_M             0x00000008
#define AM_REG_CTIMER_INTCLR_CTMRB1INT(n)            (((uint32_t)(n) << 3) & 0x00000008)

// Counter/Timer A1 interrupt.
#define AM_REG_CTIMER_INTCLR_CTMRA1INT_S             2
#define AM_REG_CTIMER_INTCLR_CTMRA1INT_M             0x00000004
#define AM_REG_CTIMER_INTCLR_CTMRA1INT(n)            (((uint32_t)(n) << 2) & 0x00000004)

// Counter/Timer B0 interrupt.
#define AM_REG_CTIMER_INTCLR_CTMRB0INT_S             1
#define AM_REG_CTIMER_INTCLR_CTMRB0INT_M             0x00000002
#define AM_REG_CTIMER_INTCLR_CTMRB0INT(n)            (((uint32_t)(n) << 1) & 0x00000002)

// Counter/Timer A0 interrupt.
#define AM_REG_CTIMER_INTCLR_CTMRA0INT_S             0
#define AM_REG_CTIMER_INTCLR_CTMRA0INT_M             0x00000001
#define AM_REG_CTIMER_INTCLR_CTMRA0INT(n)            (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// CTIMER_INTSET - Counter/Timer Interrupts: Set
//
//*****************************************************************************
// Counter/Timer B3 interrupt.
#define AM_REG_CTIMER_INTSET_CTMRB3INT_S             7
#define AM_REG_CTIMER_INTSET_CTMRB3INT_M             0x00000080
#define AM_REG_CTIMER_INTSET_CTMRB3INT(n)            (((uint32_t)(n) << 7) & 0x00000080)

// Counter/Timer A3 interrupt.
#define AM_REG_CTIMER_INTSET_CTMRA3INT_S             6
#define AM_REG_CTIMER_INTSET_CTMRA3INT_M             0x00000040
#define AM_REG_CTIMER_INTSET_CTMRA3INT(n)            (((uint32_t)(n) << 6) & 0x00000040)

// Counter/Timer B2 interrupt.
#define AM_REG_CTIMER_INTSET_CTMRB2INT_S             5
#define AM_REG_CTIMER_INTSET_CTMRB2INT_M             0x00000020
#define AM_REG_CTIMER_INTSET_CTMRB2INT(n)            (((uint32_t)(n) << 5) & 0x00000020)

// Counter/Timer A2 interrupt.
#define AM_REG_CTIMER_INTSET_CTMRA2INT_S             4
#define AM_REG_CTIMER_INTSET_CTMRA2INT_M             0x00000010
#define AM_REG_CTIMER_INTSET_CTMRA2INT(n)            (((uint32_t)(n) << 4) & 0x00000010)

// Counter/Timer B1 interrupt.
#define AM_REG_CTIMER_INTSET_CTMRB1INT_S             3
#define AM_REG_CTIMER_INTSET_CTMRB1INT_M             0x00000008
#define AM_REG_CTIMER_INTSET_CTMRB1INT(n)            (((uint32_t)(n) << 3) & 0x00000008)

// Counter/Timer A1 interrupt.
#define AM_REG_CTIMER_INTSET_CTMRA1INT_S             2
#define AM_REG_CTIMER_INTSET_CTMRA1INT_M             0x00000004
#define AM_REG_CTIMER_INTSET_CTMRA1INT(n)            (((uint32_t)(n) << 2) & 0x00000004)

// Counter/Timer B0 interrupt.
#define AM_REG_CTIMER_INTSET_CTMRB0INT_S             1
#define AM_REG_CTIMER_INTSET_CTMRB0INT_M             0x00000002
#define AM_REG_CTIMER_INTSET_CTMRB0INT(n)            (((uint32_t)(n) << 1) & 0x00000002)

// Counter/Timer A0 interrupt.
#define AM_REG_CTIMER_INTSET_CTMRA0INT_S             0
#define AM_REG_CTIMER_INTSET_CTMRA0INT_M             0x00000001
#define AM_REG_CTIMER_INTSET_CTMRA0INT(n)            (((uint32_t)(n) << 0) & 0x00000001)

//*****************************************************************************
//
// CTIMER_TMR0 - Counter/Timer Register
//
//*****************************************************************************
// Counter/Timer B0.
#define AM_REG_CTIMER_TMR0_CTTMRB0_S                 16
#define AM_REG_CTIMER_TMR0_CTTMRB0_M                 0xFFFF0000
#define AM_REG_CTIMER_TMR0_CTTMRB0(n)                (((uint32_t)(n) << 16) & 0xFFFF0000)

// Counter/Timer A0.
#define AM_REG_CTIMER_TMR0_CTTMRA0_S                 0
#define AM_REG_CTIMER_TMR0_CTTMRA0_M                 0x0000FFFF
#define AM_REG_CTIMER_TMR0_CTTMRA0(n)                (((uint32_t)(n) << 0) & 0x0000FFFF)

//*****************************************************************************
//
// CTIMER_CMPRA0 - Counter/Timer A0 Compare Registers
//
//*****************************************************************************
// Counter/Timer A0 Compare Register 1. Holds the upper limit for timer half A.
#define AM_REG_CTIMER_CMPRA0_CMPR1A0_S               16
#define AM_REG_CTIMER_CMPRA0_CMPR1A0_M               0xFFFF0000
#define AM_REG_CTIMER_CMPRA0_CMPR1A0(n)              (((uint32_t)(n) << 16) & 0xFFFF0000)

// Counter/Timer A0 Compare Register 0. Holds the lower limit for timer half A.
#define AM_REG_CTIMER_CMPRA0_CMPR0A0_S               0
#define AM_REG_CTIMER_CMPRA0_CMPR0A0_M               0x0000FFFF
#define AM_REG_CTIMER_CMPRA0_CMPR0A0(n)              (((uint32_t)(n) << 0) & 0x0000FFFF)

//*****************************************************************************
//
// CTIMER_CMPRB0 - Counter/Timer B0 Compare Registers
//
//*****************************************************************************
// Counter/Timer B0 Compare Register 1. Holds the upper limit for timer half B.
#define AM_REG_CTIMER_CMPRB0_CMPR1B0_S               16
#define AM_REG_CTIMER_CMPRB0_CMPR1B0_M               0xFFFF0000
#define AM_REG_CTIMER_CMPRB0_CMPR1B0(n)              (((uint32_t)(n) << 16) & 0xFFFF0000)

// Counter/Timer B0 Compare Register 0. Holds the lower limit for timer half B.
#define AM_REG_CTIMER_CMPRB0_CMPR0B0_S               0
#define AM_REG_CTIMER_CMPRB0_CMPR0B0_M               0x0000FFFF
#define AM_REG_CTIMER_CMPRB0_CMPR0B0(n)              (((uint32_t)(n) << 0) & 0x0000FFFF)

//*****************************************************************************
//
// CTIMER_CTRL0 - Counter/Timer Control
//
//*****************************************************************************
// Counter/Timer A0/B0 Link bit.
#define AM_REG_CTIMER_CTRL0_CTLINK0_S                31
#define AM_REG_CTIMER_CTRL0_CTLINK0_M                0x80000000
#define AM_REG_CTIMER_CTRL0_CTLINK0(n)               (((uint32_t)(n) << 31) & 0x80000000)
#define AM_REG_CTIMER_CTRL0_CTLINK0_TWO_16BIT_TIMERS 0x00000000
#define AM_REG_CTIMER_CTRL0_CTLINK0_32BIT_TIMER      0x80000000

// Counter/Timer B0 output polarity.
#define AM_REG_CTIMER_CTRL0_TMRB0POL_S               28
#define AM_REG_CTIMER_CTRL0_TMRB0POL_M               0x10000000
#define AM_REG_CTIMER_CTRL0_TMRB0POL(n)              (((uint32_t)(n) << 28) & 0x10000000)
#define AM_REG_CTIMER_CTRL0_TMRB0POL_NORMAL          0x00000000
#define AM_REG_CTIMER_CTRL0_TMRB0POL_INVERTED        0x10000000

// Counter/Timer B0 Clear bit.
#define AM_REG_CTIMER_CTRL0_TMRB0CLR_S               27
#define AM_REG_CTIMER_CTRL0_TMRB0CLR_M               0x08000000
#define AM_REG_CTIMER_CTRL0_TMRB0CLR(n)              (((uint32_t)(n) << 27) & 0x08000000)
#define AM_REG_CTIMER_CTRL0_TMRB0CLR_RUN             0x00000000
#define AM_REG_CTIMER_CTRL0_TMRB0CLR_CLEAR           0x08000000

